zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/periph1/PERI_DMA.h
/*
** ###################################################################
**     Processors:          LPC5534JBD100
**                          LPC5534JBD64
**                          LPC5534JHI48
**                          LPC5536JBD100
**                          LPC5536JBD64
**                          LPC5536JHI48
**                          LPC55S36JBD100
**                          LPC55S36JHI48
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260515
**
**     Abstract:
**         CMSIS Peripheral Access Layer for DMA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2021-04-12)
**         Initial version based on RM DraftF
**     - rev. 1.1 (2021-08-04)
**         Initial version based on RM DraftG
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_DMA.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for DMA
 *
 * CMSIS Peripheral Access Layer for DMA
 */

#if !defined(PERI_DMA_H_)
#define PERI_DMA_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_LPC5534JBD100) || defined(CPU_LPC5534JBD64) || defined(CPU_LPC5534JHI48))
#include "LPC5534_COMMON.h"
#elif (defined(CPU_LPC5536JBD100) || defined(CPU_LPC5536JBD64) || defined(CPU_LPC5536JHI48))
#include "LPC5536_COMMON.h"
#elif (defined(CPU_LPC55S36JBD100) || defined(CPU_LPC55S36JHI48))
#include "LPC55S36_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(DMA_REQUEST_SOURCE_T_)
#define DMA_REQUEST_SOURCE_T_
/*!
 * @addtogroup dma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source
{
    kDma0RequestFLEXSPIRX           = 0U,          /**< Unused DMA request 0 (DMA channel reserved for DMA trigger of FlexSPI RX) */
    kDma1RequestUnusedDMARequest0   = 0U,          /**< Unused DMA request 0 */
    kDma0RequestFLEXSPITX           = 1U,          /**< Unused DMA request 1 (DMA channel reserved for DMA trigger of FlexSPI TX) */
    kDma1RequestUnusedDMARequest1   = 1U,          /**< Unused DMA request 1 */
    kDma0RequestHSSPIRX             = 2U,          /**< Flexcomm Interface 8 RX/High Speed SPI RX */
    kDma1RequestHSLSPIRX            = 2U,          /**< Flexcomm Interface 8 RX/High Speed SPI RX */
    kDma0RequestHSSPITX             = 3U,          /**< Flexcomm Interface 8 TX/High Speed SPI TX */
    kDma1RequestHSLSPITX            = 3U,          /**< Flexcomm Interface 8 TX/High Speed SPI TX */
    kDma0RequestFlexcomm0Rx         = 4U,          /**< Flexcomm Interface 0 RX/I2C Slave */
    kDma1RequestFlexcomm0Rx         = 4U,          /**< Flexcomm Interface 0 RX */
    kDma0RequestFlexcomm0Tx         = 5U,          /**< Flexcomm Interface 0 TX/I2C Master */
    kDma1RequestFlexcomm0Tx         = 5U,          /**< Flexcomm Interface 0 TX */
    kDma0RequestFlexcomm1Rx         = 6U,          /**< Flexcomm Interface 1 RX/I2C Slave */
    kDma1RequestFlexcomm1Rx         = 6U,          /**< Flexcomm Interface 1 RX */
    kDma0RequestFlexcomm1Tx         = 7U,          /**< Flexcomm Interface 1 TX/I2C Master */
    kDma1RequestFlexcomm1Tx         = 7U,          /**< Flexcomm Interface 1 TX */
    kDma0RequestFlexcomm3Rx         = 8U,          /**< Flexcomm Interface 3 RX/I2C Slave */
    kDma1RequestFlexcomm3Rx         = 8U,          /**< Flexcomm Interface 3 RX */
    kDma0RequestFlexcomm3Tx         = 9U,          /**< Flexcomm Interface 3 TX/I2C Master */
    kDma1RequestFlexcomm3Tx         = 9U,          /**< Flexcomm Interface 3 TX */
    kDma0RequestFlexcomm2Rx         = 10U,         /**< Flexcomm Interface 2 RX/I2C Slave */
    kDma1RequestDmic0Ch0            = 10U,         /**< DMIC0 Channel 0 */
    kDma0RequestFlexcomm2Tx         = 11U,         /**< Flexcomm Interface 2 TX/I2C Master */
    kDma1RequestDmic0Ch1            = 11U,         /**< DMIC0 Channel 1 */
    kDma0RequestFlexcomm4Rx         = 12U,         /**< Flexcomm Interface 4 RX/I2C Slave */
    kDma1RequestI3c0Rx              = 12U,         /**< I3C0 RX */
    kDma0RequestFlexcomm4Tx         = 13U,         /**< Flexcomm Interface 4 TX/I2C Master */
    kDma1RequestI3c0Tx              = 13U,         /**< I3C0 TX */
    kDma0RequestFlexcomm5Rx         = 14U,         /**< Flexcomm Interface 5 RX/I2C Slave */
    kDma1RequestFLEXSPIRX           = 14U,         /**< Unused DMA request 14 (DMA channel reserved for DMA trigger of FlexSPI RX) */
    kDma0RequestFlexcomm5Tx         = 15U,         /**< Flexcomm Interface 5 TX/I2C Master */
    kDma1RequestFLEXSPITX           = 15U,         /**< Unused DMA request 15 (DMA channel reserved for DMA trigger of FlexSPI TX) */
    kDma0RequestFlexcomm6Rx         = 16U,         /**< Flexcomm Interface 6 RX/I2C Slave */
    kDma0RequestFlexcomm6Tx         = 17U,         /**< Flexcomm Interface 6 TX/I2C Master */
    kDma0RequestFlexcomm7Rx         = 18U,         /**< Flexcomm Interface 7 RX/I2C Slave */
    kDma0RequestFlexcomm7Tx         = 19U,         /**< Flexcomm Interface 7 TX/I2C Master */
    kDma0RequestDAC0                = 20U,         /**< DAC0 */
    kDma0RequestADC0FIFO0           = 21U,         /**< ADC0 FIFO 0 */
    kDma0RequestADC0FIFO1           = 22U,         /**< ADC0 FIFO 1 */
    kDma0RequestDMIC0CH0            = 23U,         /**< DMIC0 channel 0 */
    kDma0RequestDMIC0CH1            = 24U,         /**< DMIC0 channel 1 */
    kDma0RequestI3C0RX              = 25U,         /**< I3C0 RX */
    kDma0RequestI3C0TX              = 26U,         /**< I3C0 TX */
    kDma0RequestADC1FIFO0           = 27U,         /**< ADC1 FIFO 0 */
    kDma0RequestADC1FIFO1           = 28U,         /**< ADC1 FIFO 1 */
    kDma0RequestDAC1                = 29U,         /**< DAC1 */
    kDma0RequestDAC2                = 30U,         /**< DAC2 */
    kDma0RequestUnusedDMARequest31  = 31U,         /**< Unused DMA request 31 */
    kDma0RequestUnusedDMARequest32  = 32U,         /**< Unused DMA request 32 */
    kDma0RequestUnusedDMARequest33  = 33U,         /**< Unused DMA request 33 */
    kDma0RequestUnusedDMARequest34  = 34U,         /**< Unused DMA request 34 */
    kDma0RequestUnusedDMARequest35  = 35U,         /**< Unused DMA request 35 */
    kDma0RequestUnassignedDMARequest36 = 36U,      /**< Unused DMA request 36 (DMA channel reserved for DMA trigger of FlexPWM0 Read Capture 0) */
    kDma0RequestUnassignedDMARequest37 = 37U,      /**< Unused DMA request 37 (DMA channel reserved for DMA trigger of FlexPWM0 Read Capture 1) */
    kDma0RequestUnassignedDMARequest38 = 38U,      /**< Unused DMA request 38 (DMA channel reserved for DMA trigger of FlexPWM0 Read Capture 2) */
    kDma0RequestUnassignedDMARequest39 = 39U,      /**< Unused DMA request 39 (DMA channel reserved for DMA trigger of FlexPWM0 Read Capture 3) */
    kDma0RequestUnassignedDMARequest40 = 40U,      /**< Unused DMA request 40 (DMA channel reserved for DMA trigger of FlexPWM0 Write Value 0) */
    kDma0RequestUnassignedDMARequest41 = 41U,      /**< Unused DMA request 41 (DMA channel reserved for DMA trigger of FlexPWM0 Write Value 1) */
    kDma0RequestUnassignedDMARequest42 = 42U,      /**< Unused DMA request 42 (DMA channel reserved for DMA trigger of FlexPWM0 Write Value 2) */
    kDma0RequestUnassignedDMARequest43 = 43U,      /**< Unused DMA request 43 (DMA channel reserved for DMA trigger of FlexPWM0 Write Value 3) */
    kDma0RequestUnassignedDMARequest44 = 44U,      /**< Unused DMA request 44 (DMA channel reserved for DMA trigger of FlexPWM1 Read Capture 0) */
    kDma0RequestUnassignedDMARequest45 = 45U,      /**< Unused DMA request 45 (DMA channel reserved for DMA trigger of FlexPWM1 Read Capture 1) */
    kDma0RequestUnassignedDMARequest46 = 46U,      /**< Unused DMA request 46 (DMA channel reserved for DMA trigger of FlexPWM1 Read Capture 2) */
    kDma0RequestUnassignedDMARequest47 = 47U,      /**< Unused DMA request 47 (DMA channel reserved for DMA trigger of FlexPWM1 Read Capture 3) */
    kDma0RequestUnassignedDMARequest48 = 48U,      /**< Unused DMA request 48 (DMA channel reserved for DMA trigger of FlexPWM1 Write Value 0) */
    kDma0RequestUnassignedDMARequest49 = 49U,      /**< Unused DMA request 49 (DMA channel reserved for DMA trigger of FlexPWM1 Write Value 1) */
    kDma0RequestUnassignedDMARequest50 = 50U,      /**< Unused DMA request 50 (DMA channel reserved for DMA trigger of FlexPWM1 Write Value 2) */
    kDma0RequestUnassignedDMARequest51 = 51U,      /**< Unused DMA request 51 (DMA channel reserved for DMA trigger of FlexPWM1 Write Value 3) */
} dma_request_source_t;

/* @} */
#endif /* DMA_REQUEST_SOURCE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


